In [18]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [19]:
data = {1:"Faisal",2:"Ahmed",3:"Khalid"}
series= pd.Series(data)
series

1    Faisal
2     Ahmed
3    Khalid
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [20]:
series.index = (11,12,13)
series

11    Faisal
12     Ahmed
13    Khalid
dtype: object

## Q3: Retrieve First and second elements.

In [21]:
series[:2]

11    Faisal
12     Ahmed
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [27]:
series2 = pd.Series({11:"Munira",14:"Faisal"})
series3 = pd.concat((series2, series))
print(series3)
print()
series3.drop_duplicates(inplace=True)
print(series3)

11    Munira
14    Faisal
11    Faisal
12     Ahmed
13    Khalid
dtype: object

11    Munira
14    Faisal
12     Ahmed
13    Khalid
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [28]:
data2 = {
    'ID': [1,2,3],
        'Name': ['Faisal','Meteb','Ryan'],
        'GPA': ["4/4", "3/4", "3.5/4"],
       }

students=pd.DataFrame(data2)

students

   ID    Name    GPA
0   1  Faisal    4/4
1   2   Meteb    3/4
2   3    Ryan  3.5/4

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [29]:
edu = pd.read_csv("./educ_figdp_1_Data.csv")

edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [35]:
print(students[0:2])
print()
print(students.loc[0:2])

   ID    Name  GPA
0   1  Faisal  4/4
1   2   Meteb  3/4

   ID    Name    GPA
0   1  Faisal    4/4
1   2   Meteb    3/4
2   3    Ryan  3.5/4